<template>
  <div class="visualization-table-container">
    <table class="datatable">
      <thead>
        <tr>
          <th
            v-for="(header, index) in headers"
            :key="`th-${index}`"
            v-text="header"
          />
        </tr>
      </thead>
      <tbody>
        <tr v-for="(row, rowIndex) in dataset" :key="`row-${rowIndex}`">
          <td
            v-for="(colName, colIndex) in headers"
            :key="`row-${rowIndex}-col-${colIndex}`"
            v-text="row[colName]"
          />
        </tr>
      </tbody>
    </table>
  </div>
</template>

<script>
export default {
  name: 'PluginComponent',
  data: (self) => ({
    logSystem: self.$root.logSystem,
    eventSystem: self.$root.eventSystem,
    headers: [],
    dataset: [
      {
        '№': '1',
        'Мероприятие': 'Привлечение дополнительного ПС в оперирование',
        'Ответственный': 'Воронин Л.А.',
        'Срок': '30.06.2020',
      },
      {
        '№': '1.1',
        'Мероприятие': 'Заключение договора лизинга по привлечению 5 000 ПВ',
        'Ответственный': 'Воронин Л.А.',
        'Срок': '31.05.2020',
      },
      {
        '№': '1.1.1',
        'Мероприятие': 'Поиск контрагентов готовых предоставить ПВ в лизинг',
        'Ответственный': 'Буевич Д.Р.',
        'Срок': '28.02.2020',
      },
      {
        '№': '1.1.2',
        'Мероприятие': 'Сопровождение сделки в финансовых учреждениях',
        'Ответственный': 'Великанов М.В.',
        'Срок': '31.03.2020',
      },
      {
        '№': '1.1.3',
        'Мероприятие': 'Организация закупочных процедур',
        'Ответственный': 'Маркова О.В.',
        'Срок': '31.03.2020',
      },
      {
        '№': '1.1.4',
        'Мероприятие': 'Организация корпоративных процедур по одобрению сделки',
        'Ответственный': 'Абдуллаева Р.Г.',
        'Срок': '30.04.2020',
      },
      {
        '№': '1.1.5',
        'Мероприятие': 'Приемка ПВ и постановка ПВ в АССБ',
        'Ответственный': 'Мальцев Е.В.',
        'Срок': '31.05.2020',
      },
      {
        '№': '1.2',
        'Мероприятие': 'Закупка инновационных ПВ в объёме 2 000 шт.',
        'Ответственный': 'Шевцов А.М.',
        'Срок': '30.06.2020',
      },
      { '№': '1.2.1', 'Мероприятие': 'Название мероприятия', 'Ответственный': 'Ответственный', 'Срок': 'Срок' },
      { '№': '1.2.2', 'Мероприятие': 'Название мероприятия', 'Ответственный': 'Ответственный', 'Срок': 'Срок' },
      { '№': '1.3', 'Мероприятие': 'Название мероприятия', 'Ответственный': 'Ответственный', 'Срок': 'Срок' },
      { '№': '1.4', 'Мероприятие': 'Название мероприятия', 'Ответственный': 'Ответственный', 'Срок': 'Срок' },
      { '№': '1.5', 'Мероприятие': 'Название мероприятия', 'Ответственный': 'Ответственный', 'Срок': 'Срок' },
    ],
  }),
  mounted() {
    this.createHeaders();
  },
  methods: {
    createHeaders() {
      this.headers = this.dataset.length <= 0 ? [] : Object.keys(this.dataset[0]);
    },
  },
};
</script>

<style lang="sass">
@import ./styles/component
</style>
